[
    {
        "act":4,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Escalar as paredes pelas rochas proeminentes.",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Escalar sem as ferramentas adequadas é extremamente difícil para você, que cai algumas vezes até finalmente ter sucesso."
                    },
                    {
                        "id": 2,
                        "text": "Amarrar sua corda em sua lança para servir de apoio quando puder a prender em algum lugar.",
                        "score": 0,
                        "damage": 5,
                        "consequence": "Seu aparato é rústico, mas tem certa eficiência, você escala com alguns problemas tendo alguns arranhões no processo, mas chega ao topo."
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Escalar os galhos das árvores para evitar o gelo.",
                        "score": -5,
                        "damage": 5,
                        "consequence": "Neste ponto da aventura, você se toca que escalar não é seu forte, você cai no caminho e prossegue caminhando."
                    },
                    {
                        "id": 2,
                        "text": "Caminhar normalmente pelo gelo.",
                        "score": -5,
                        "damage": 0,
                        "consequence": "Você caminha e tomba algumas vezes por falta de equipamento específico."
                    },
                    {
                        "id": 3,
                        "text": "Usar sua Lança como apoio, furando o gelo para ter fixação.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "Consegue um apoio fixo, perde alguns minutos, mas nada que o atrase."
                    },
                    {
                        "id": 4,
                        "text": "Deslizar pelo gelo.",
                        "score": -5,
                        "damage": 5,
                        "consequence": "Você desliza rapidamente, mas sem conseguir evitar a colisão com algumas rochas e galhos no caminho."
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Entregar a coroa.",
                        "score": -10,
                        "consequence": "Você entrega a coroa. O rei fica muito satisfeito enquanto sorri e diz que em breve você receberá a maior honraria já vista. Ele coloca a coroa sobre sua cabeça e ri, mas seu riso é abafado por uma cara de espanto. Seus olhos reviram e ele começa a gritar de agonia, enquanto seu corpo incha e racha. Os gritos de agonia se tornam grunhidos vindo dos mais terríveis pesadelos, ele começa a se transformar em uma criatura monstruosa de gelo e ataca todos ali. Os soldados e você lutam contra ele enquanto emite os sons agonizantes, até que apenas você sobrevive para finalizar o ocorrido e destruir a criatura, que cai morta, com a coroa saindo de sua cabeça e o corpo do Rei morto por marca de suas armas caindo em sua frente.",
                        "damage": 30
                    },
                    {
                        "id": 2,
                        "text": "Atacar o guarda mais próximo e se recusar a entregar.",
                        "score": 0,
                        "consequence": "Você ataca o guarda mais próximo e começa um combate, um por um você os derruba, até que o próprio Rei também cai por suas mãos, em um trágico e inevitável fim.",
                        "damage": 20
                    },
                    {
                        "id": 3,
                        "text": "Colocar a coroa você mesmo sobre o Rei.",
                        "score": -15,
                        "consequence": "Você diz que você mesmo deve ter as honras, o Rei sorri e diz que você receberá a maior honraria já vista enquanto você posiciona a coroa sobre sua cabeça e ele ri, mas seu riso é abafado por uma cara de espanto. Seus olhos reviram e ele começa a gritar de agonia, enquanto seu corpo incha e racha. Os gritos de agonia se tornam grunhidos vindo dos mais terríveis pesadelos, ele começa a se transformar em uma criatura monstruosa de gelo e ataca todos ali. Os soldados e você lutam contra ele enquanto emite os sons agonizantes, até que apenas você sobrevive para finalizar o ocorrido e destruir a criatura, que cai morta, com a coroa saindo de sua cabeça e o corpo do Rei morto por marca de suas armas caindo em sua frente.",
                        "damage": 35
                    },
                    {
                        "id": 4,
                        "text": "Mentir que não encontrou a coroa.",
                        "score": -10,
                        "consequence": "Toda a música para, a alegria do local some enquanto o Rei fica sério e diz não acreditar em você, pela sua ousadia ele comanda os soldados que eliminem você e procurem pela coroa. Começa um combate, um por um você os derruba, até que o próprio Rei também cai por suas mãos, em um trágico e inevitável fim.",
                        "damage": 20
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Fazer a jornada de volta à caverna e devolver a coroa.",
                        "score": 15,
                        "consequence": "Você faz a longa jornada novamente, o frio afujentou muitas criaturas, mas o caminho ainda era perigoso, mas você devolve a coroa ao seu devido lugar, ela o agradece dizendo que você fez a coisa certa.",
                        "damage": 20
                    },
                    {
                        "id": 2,
                        "text": "Tomar a coroa para si, colocando-a sobre a cabeça.",
                        "score": 0,
                        "consequence": "Você se torna vítima da maldição da coroa, perdendo seus sentidos.",
                        "damage": 0
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "consequence": "",
                        "damage": 0
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "consequence": "",
                        "damage": 0
                    }
                ]
            }
        ]
    },
    {
        "act":4,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Debater-se para quebrar o galho que prende a armadilha.",
                        "score": -5,
                        "consequence": "Você se debate na rede até que o galho prega e o derruba no chão.",
			"damage": 5
                    },
                    {
                        "id": 2,
                        "text": "Usar suas mãos para romper a rede.",
                        "score": -5,
                        "consequence": "Você força várias vezes até que finalmente consegue rasgar a rede e machucar suas mãos. Caindo no chão.",
			"damage": 10
                    },
                    {
                        "id": 3,
                        "text": "Usar sua Espada para cortar a rede.",
                        "score": 5,
                        "consequence": "Você facilmente corta a rede e cai no chão.",
			"damage": 5
                    },
                    {
                        "id": 4,
                        "text": "Usar sua Lança para cortar a rede.",
                        "score": 0,
                        "consequence": "Com alguma dificuldade você corta a rede e cai no chão.",
			"damage": 5
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Dizer que não possui a coroa.",
                        "score": 5,
                        "consequence": "Eles não acreditam e começa um combate, você ataca com suas armas que causam congelamento na pele dos inimigos, deixando-os mais lentos até que os vence.",
			"damage": 5
                    },
                    {
                        "id": 2,
                        "text": "Atacar subitamente com sua Lança de duas Mãos o mais próximo.",
                        "score": 5,
                        "consequence": "Sua lança está repleta dos poderes de gelo, cada movimento dela espalha rajadas congelantes em volta que aterrorizam os inimigos, você os derrota facilmente.",
			"damage": 0
                    },
                    {
                        "id": 3,
                        "text": "Usar sua Investida para fugir.",
                        "score": -5,
                        "consequence": "Você foge, mas não sem levar alguns ataques de flechas antes.",
			"damage": 10
                    },
                    {
                        "id": 4,
                        "text": "Dizer que não sabe do que estão falando.",
                        "score": -5,
                        "consequence": "Eles não compram sua ideia e o atacam imediatamente, suas armas causam congelamento na pele dos inimigos, deixando-os mais lentos até que os vence.",
			"damage": 5
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Atacar o Ogro com sua Lança de Duas Mãos.",
                        "score": 0,
                        "consequence": "Você o ataca com sua lança, a criatura é extremamente voraz e o ataca de volta, resistindo aos cortes de gelo, mas eventualmente caindo para suas armas.",
			"damage": 5
                    },
                    {
                        "id": 2,
                        "text": "Atacar o Ogro com sua Espada e Escudo.",
                        "score": 5,
                        "consequence": "Você o ataca com sua espada, a criatura é extremamente voraz e o ataca de volta, mas seu escudo está fortalecido por uma aura de gelo que mitiga os golpes da criatura, resistindo aos cortes de gelo, mas eventualmente caindo para suas armas.",
			"damage": 0
                    },
                    {
                        "id": 3,
                        "text": "Usar sua Investida para fugir do Ogro.",
                        "score": -5,
                        "consequence": "Você foge, mas não antes de ser atacado por grandes rochas arremessadas pelo Ogro, ele não desistirá e você resolve o enfrentar em uma luta, terminando por vencer.",
			"damage": 15
                    },
                    {
                        "id": 4,
                        "text": "Se esconder do Ogro.",
                        "score": -10,
                        "consequence": "Ele o persegue pelo cheiro, logo você se toca que não há como o evitar e entra em combate direto, o vencendo eventualmente.",
			"damage": 5
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Fugir do reino.",
                        "score": -10,
                        "consequence": "Você desvia seu caminho e vai em direção às fronteiras, escondendo sua identidade.",
			"damage": 0
                    },
                    {
                        "id": 2,
                        "text": "Ir acertar as contas com o Rei.",
                        "score": 10,
                        "consequence": "Você vai a caminho do palácio, com suas armas e seu anel, resolver de uma vez por todas o ocorrido e os enfrentando se necessário.",
			"damage": 10
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "consequence": "",
			"damage": 0
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "consequence": "",
			"damage": 0
                    }
                ]
            }
        ]
    }

]