[
    {
        "act":3,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Tentar ler as inscrições mágicas.",
                        "score": -15,
                        "damage": 0,
                        "consequence": "Você passa muito tempo, horas, tentando decifrar as runas, sem sucesso algum, nada parece fazer sentido, você acaba desistindo e recorrendo à força para abrir."
                    },
                    {
                        "id": 2,
                        "text": "Tentar arrombar o mecanismo de tranca.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "Você passa horas tentando destravar o mecanismo, até que finalmente desiste e usa a força para abrir."
                    },
                    {
                        "id": 3,
                        "text": "Usar a força para derrubar a porta.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "Você força a porta por um bom tempo, ela é muito resistente e fria, mas eventualmente cede e abre."
                    },
                    {
                        "id": 4,
                        "text": "Meditar para tentar encontrar uma maneira de entrar.",
                        "score": -5,
                        "damage": 0,
                        "consequence": "Você medita para tentar encontrar uma solução, mas nada vem em mente e você recorre à força para abrir."
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Engajar o combate usando a Lança de Duas Mãos.",
                        "score": 5,
                        "damage": 5,
                        "consequence": "Embora esqueletos sejam resistentes a lâminas, você luta bravamente, dominando o combate com sua lança e saindo com algumas escoriaçoes apenas."
                    },
                    {
                        "id": 2,
                        "text": "Engajar o combate usando a Espada e Escudo",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Embora esqueletos sejam resistentes a lâminas, você leva o combate em um ritmo bom, sendo golpeado em alguns momentos, mas saindo vivo."
                    },
                    {
                        "id": 3,
                        "text": "Usar investida para passar rapidamente pelos inimigos.",
                        "score": -10,
                        "damage": 20,
                        "consequence": "O piso de gelo é liso, você perde o equilíbrio e acaba caindo, enquanto os inimigos lhe atacam impiedosamente até que você possa se levantar e contra-atacar."
                    },
                    {
                        "id": 4,
                        "text": "Passar furtivamente sem tentar chamar atenção.",
                        "score": -5,
                        "damage": 20,
                        "consequence": "Furtividade não é seu forte, os inimigos percebem sua passagem e o atacam primeiro."
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Analisar o padrão das lajotas e pessoas congeladas para encontar um caminho seguro.",
                        "score": -10,
                        "consequence": "Você realmente não entende como o mecanismo funciona, assim precisando correr para o outro lado. Você é atingido por raios de gelo que causam uma dor intensa, mas sua armadura o protege de parte do dano evitando que congele totalmente.",
                        "damage": 20
                    },
                    {
                        "id": 2,
                        "text": "Tentar saltar sobre as estátuas para chegar ao outro lado.",
                        "score": -10,
                        "consequence": "Você não é leve, nem muito habilidoso para saltar com sua armadura, e precisa correr. Você é atingido por raios de gelo que causam uma dor intensa, mas sua armadura o protege de parte do dano evitando que congele totalmente..",
                        "damage": 20
                    },
                    {
                        "id": 3,
                        "text": "Fechar os olhos e deixar com que as forças maiores o guiem.",
                        "score": -10,
                        "consequence": "Você fecha os olhos e segue, nõ demora muito para sentir um ataque de gelo e precisar correr. Você é atingido por raios de gelo que causam uma dor intensa, mas sua armadura o protege de parte do dano evitando que congele totalmente..",
                        "damage": 30
                    },
                    {
                        "id": 4,
                        "text": "Dar uma Investida e deslizar pelo gelo.",
                        "score": 0,
                        "consequence": "Você toma impulso, corre e atravessa o campo deslizando com ajuda de seus metais, sendo atingido de raspão pelos raios de gelo.",
                        "damage": 10
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Tomar a Coroa.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "Você ignora o aviso e toma a coroa para si, a porta do templo é selada e so há como sair escalando para a abertura que há metros acima."
                    },
                    {
                        "id": 2,
                        "text": "Aceitar o Anel de Gelo.",
                        "score": 15,
                        "damage": -70,
                        "consequence": "Você aceita o anel, a voz feminina agradece e do centro da coroa um anel azul e belo, com uma gema fria em seu topo. O anel vem até seu dedo e você sente uma enrgia poderosa. Seu sangue fica frio, suas feridas são curadas, seus equipamentos e energias são envoltos de uma energiaa fria. Você é levitado até o topo do local onde há uma saída da caverna."
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    }
                ]
            }
        ]
    },
    {
        "act":3,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Usar sua força para derrubar estalactites e estalagmites para fazer um caminho sobre a lava.",
                        "score": 10,
                        "consequence": "Você derruba facilmente muitas rochas fazendo um caminho no qual se pode caminhar com segurança e atravessa.",
                        "damage": 0
                    },
                    {
                        "id": 2,
                        "text": "Saltar sobre as estalagmites, se apoiando nas estalagmites quando possível.",
                        "score": -5,
                        "consequence": "Seu grande peso e sua armadura não auxiliam, você acaba caindo na lava e se machucando seriamente.",
                        "damage": 20
                    },
                    {
                        "id": 3,
                        "text": "Usar sua Invstida para dar um salto até a maior ilha a 3m e saltar novamente para o outro lado.",
                        "score": 0,
                        "consequence": "Você core e salta para a ilha, se queimando um pouco no processo, e em seguida salta para o outro lado.",
                        "damage": 10
                    },
                    {
                        "id": 4,
                        "text": "Usar seu vigor para suportar o calor da lava enquanto caminha dentro ela.",
                        "score": -10,
                        "consequence": "O calor da lava machuca você e danifica seus equipamentos seriamente.",
                        "damage": 40
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Mantém distância lutando com a Lança de Duas Mãos.",
                        "score": 5,
                        "consequence": "Mesmo sendo um único alvo, lutar a certa distância mitigou os danos que você sofreria. Você destrói a criatura.",
                        "damage": 5
                    },
                    {
                        "id": 2,
                        "text": "Lutar com Espada e Escudo.",
                        "score": 0,
                        "consequence": "Mesmo seu escudo não é totalmente capaz de bloquear as pancadas envebidas em lava da criatura, que você derrota com muito esforço.",
                        "damage": 10
                    },
                    {
                        "id": 3,
                        "text": "Tentar fugir e o despistar.",
                        "score": -5,
                        "consequence": "Fugir não é seu forte, a criatura arremessa algumas rochas em chamas até que você consiga a despistar.",
                        "damage": 15
                    },
                    {
                        "id": 4,
                        "text": "Entrar no buraco de onde ele saiu e correr.",
                        "score": -5,
                        "consequence": "A criatura fica surpresa, mas ainda o ataca arremessando bolas em chamas enquanto você foge.",
                        "damage": 15
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Estuda o mecanismo para bolar um jeito de o abrir.",
                        "score": -5,
                        "consequence": "Nada ali faz sentido para você, você perde tempo até ir abrir girando a roda.",
                        "damage": 0
                    },
                    {
                        "id": 2,
                        "text": "Usa sua força para girar com suas próprias mãos.",
                        "score": 10,
                        "consequence": "Graças a sua Potência você abre a porta sem grandes dificuldades.",
                        "damage": 0
                    },
                    {
                        "id": 3,
                        "text": "Usa sua força para tentar abrir a porta.",
                        "score": 0,
                        "consequence": "Você faz muito esforço por minutos até que a porta acaba abrindo.",
                        "damage": 0
                    },
                    {
                        "id": 4,
                        "text": "Estuda a tranca para procurar por falhas.",
                        "score": -10,
                        "consequence": "Nada ali faz sentido para você, você perde tempo até ir abrir girando a roda.",
                        "damage": 0
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Tomar a Coroa.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "Você ignora o aviso e toma a coroa para si, a porta do templo é selada e so há como sair escalando para a abertura que há metros acima."
                    },
                    {
                        "id": 2,
                        "text": "Aceitar o Anel de Fogo.",
                        "score": 15,
                        "damage": -70,
                        "consequence": "Você aceita o anel, a voz feminina agradece e do centro da coroa um anel dourado e belo, com uma gema quente em seu topo. O anel vem até seu dedo e você sente uma enrgia poderosa. Seu sangue fica ferve, suas feridas são curadas, seus equipamentos e energias são envoltos de uma aura quente. Você é levitado até o topo do local onde há uma saída da caverna."
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "consequence": "",
                        "damage": 0
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "consequence": "",
                        "damage": 0
                    }
                ]
            }
        ]
    }

]