[
    {
        "id": 0
    },
    {
        "act":1,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Ir ao vilarejo pedir informação para a população.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "A população do vilarejo admira um guerreiro, pois é um sinal de proteção e eles colaboram com você dando uma orientação precisa sobre o loca, entretanto avisam se tratar de um lugar perigoso e amaldiçoado."
                    },
                    {
                        "id": 2,
                        "text": "Seguir para explorar a floresta.",
                        "score": 0,
                        "damage": 0,
                        "consequence": "Você caminha pela floresta, que de fato é um labirinto vivo. Você vaga a esmo por horas até encontrar o próximo ponto do mapa e seguir sua missão."
                    },
                    {
                        "id": 3,
                        "text": "Avaliar mais cuidadosamente o mapa.",
                        "score": -5,
                        "damage": 0,
                        "consequence": "Você avalia o mapa cuidadosamente, mas esse não é realmente seu forte. Você se perde algumas vezes, mas eventualmente chega ao ponto do mapa."
                    },
                    {
                        "id": 4,
                        "text": "Escalar as árvores para ter um bom ponto de visão.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "Com muita dificuldade você sobe em uma árvore em um ponto alto da floresta, sua armadura é pesada e vesti-la demora bastante. Você segue nesse fluxo que não é muito preciso, nem muito eficiente até o próximo ponto do mapa."
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Enfrentar a força do rio através do nado com seu Vigor.",
                        "score": -10,
                        "damage": 20,
                        "consequence": "Você entra no rio, que é mais fundo do que parece, você aguenta bastante com seu Vigor, entretanto a correnteza forte o atrapalha impedindo que a passagem seja tranquila. Após quase se afogar você atravessa."
                    },
                    {
                        "id": 2,
                        "text": "Tomar um grande impulso com sua Investida e saltar para o outro lado.",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Você toma impulso para saltar, mas o peso da sua armadura não ajuda em tal tarefa, você passa no máximo oito metros e é obrigado a seguir o restante do caminho pela água, após dificuldades você atravessa."
                    },
                    {
                        "id": 3,
                        "text": "Cortar madeira para tentar criar uma ponte para atravessar para o outro lado.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "Você corta diversos troncos e carrega facilmente graças a sua Potência, construindo uma pequena ponte que serve de apoio para a travessia, árdua, mas eficiente."
                    },
                    {
                        "id": 4,
                        "text": "Escalar pelos galhos das árvores para chegar ao outro lado.",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Com muita dificuldade você passa pelo galhos, mas o peso de sua armadura é seu inimigo e você cai na água, tendo que fazer metade do percurso com muita dificuldade na forte correnteza."
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Retirar os troncos pesados da barricada com ajuda de sua Lança de Duas Mãos.",
                        "score": 0,
                        "consequence": "Após algum tempo e com esforço, você retira os troncos de seu caminho.",
                        "damage": 0
                    },
                    {
                        "id": 2,
                        "text": "Escalar a barricada para chegar ao outro lado.",
                        "score": -5,
                        "consequence": "Você tenta escalar a barricada, mas um tronco podre quebra e você cai, causando alguns ferimentos leves.",
                        "damage": 10
                    },
                    {
                        "id": 3,
                        "text": "Incendiar a barricada com sua tocha.",
                        "score": -30,
                        "consequence": "Você incendeia a barricada, processo inicialente demorado, mas o fogo acaba se epalhando em algumas partes da ravina, além de se queimar você perde tempo tentando conter o incêndio.",
                        "damage": 20
                    },
                    {
                        "id": 4,
                        "text": "Usar sua Investida para derrubar a barricada.",
                        "score": 10,
                        "consequence": "Sua investida é poderosa o suficiente aliada à sua Potência, você destroça a barricada e libera o caminho.",
                        "damage": 0
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Atacar com sua Lança de Duas Mãos.",
                        "score": 10,
                        "damage": 0,
                        "consequence": "Você avança, quando seus inimigos o percebem você já decapitou o primeiro, agilmente atacou o segundo enquanto se afastou do terceiro, golpeando o último no instante em que ele o alcançou. Liberando seu caminho para a caverna."
                    },
                    {
                        "id": 2,
                        "text": "Atacar com sua Espada Curta e Escudo.",
                        "score": 0,
                        "damage": 30,
                        "consequence": "Você empunha seu escudo, os inimigos avançam e quando está em seu alcance você golpeia fatalmente o primeiro, mas os inimigos já estão em seu encalço e você acaba sendo mordido por um deles, mas corta sua cabeça e defende o ataque do último com o escudo, para o contra-atacar fatalmente. Liberando seu caminho para a caverna."
                    },
                    {
                        "id": 3,
                        "text": "Realizar uma Investida para dentro atropelando quem estiver em seu caminho.",
                        "score": 0,
                        "damage": 20,
                        "consequence": "Você avança velozmente atropelando um inimigo que bloqueava seu caminho, mas dando tempo para que outro o arranhasse durante a investida, liberando seu caminho para a caverna."
                    },
                    {
                        "id": 4,
                        "text": "Passar furtivamente por trás do grupo.",
                        "score": -10,
                        "damage": 40,
                        "consequence": "Você se esconde e se esgueira, mas sua armadura o acusa por conta do barulho, os inimigos já estão próximos demais para você se preparar melhor e entra em combate despreparado, após uma luta árdua você tem acesso à caverna."
                    }
                ]
            }
        ]
    },
    {
        "act":2,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Usar sua Investida para pegar impulso e saltar sobre o desfiladeiro de aproximadament 6 metros.",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Você salta, mas não consegue atravessar o desfiladeiro por completo, se agarrando a umas rochas e se machucando no processo."
                    },
                    {
                        "id": 2,
                        "text": "Caminhar pela passarela estreita próxima à parede utilizando sua Lança de duas mãos como sustentação.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "Você caminha utilizando sua lança como apoio, por ter uma longa haste ela serve de forma ideal."
                    },
                    {
                        "id": 3,
                        "text": "Descer até o fundo do precipício e escalar novamente ao final.",
                        "score": -5,
                        "damage": 5,
                        "consequence": "Você demora um longo tempo, pois o desfiladeiro possui algumas dezenas de metros de altura e a subida é árdua."
                    },
                    {
                        "id": 4,
                        "text": "Caminhar pela passarela estreita próxima à parede utilizando sua Lança de duas mãos como sustentação.",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Você se equilibra como pode, acaba caindo e tendo que se segurar em algumas rochas, dificultando o caminho pois a espada é curta demais para esta tarefa."
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Desviar o caminho e tentar encontrar outra rota diferente do mapa.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "As cavernas são confusas, seguir por zonas não mapeadas se mostra complicado demais e você perde horas e recursos."
                    },
                    {
                        "id": 2,
                        "text": "Iniciar o combate utilizando a Lança de Duas Mãos.",
                        "score": -5,
                        "damage": 20,
                        "consequence": "Você entra em combate com a criatura, que é forte e resistente revidando aos seus ataques, sua lança não lhe garante grande vantagem para bloquear ataques das grandes mãos da criatura e você sai ferido apos a derrotar."
                    },
                    {
                        "id": 3,
                        "text": "Iniciar o combate utilizando a Espada e Escudo.",
                        "score": 5,
                        "damage": 5,
                        "consequence": "Você luta bravamente contra a criatura, bloqueando seus golpes e contra-atacando até que por fim ela cai e você sai riufante com alguns arranhões."
                    },
                    {
                        "id": 4,
                        "text": "Passar furtivamente por tras da criatura.",
                        "score": -10,
                        "damage": 30,
                        "consequence": "Furtividade não é seu ponto forte, a criatura o percebe e ataca primeiro, você saca suas armas e a combate, já ferido e abalado."
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Usar seu Vigor para resistir em frente a pedra e a parar.",
                        "score": -5,
                        "damage": 10,
                        "consequence": "Você para a pedra a um alto custo, pois seu peso é mais do que você poderia aguentar, tendo contusões."
                    },
                    {
                        "id": 2,
                        "text": "Tentar se esgueirar pelo canto da parede e evitar que a pedra o esmague.",
                        "score": -10,
                        "damage": 20,
                        "consequence": "Agilidade em sua armdura não é seu forte, você tenta se esgueirar, mas a pedra esmaga seus membros causando grande dor."
                    },
                    {
                        "id": 3,
                        "text": "Contra-atacar a pedra com seu escudo para a destruir.",
                        "score": -5,
                        "damage": 15,
                        "consequence": "Você contra-ataca, mas com pouco efeito, a pedra apenas racha e o empurra alguns metros até ser destruída."
                    },
                    {
                        "id": 4,
                        "text": "Usar sua Investida para descer rapidamente para uma zona segura.",
                        "score": 10,
                        "damage": 0,
                        "consequence": "Você rapidamente corre para uma zona segura, a pedra chega ao fim do corredor e se estilhaça permitino sua passagem."
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Esquerda, O caminho do Gelo.",
                        "score": -5,
                        "damage": 0,
                        "consequence": "Você segue o caminho, conforme o clima esfria e você vê fractais de gelo se formando."
                    },
                    {
                        "id": 2,
                        "text": "Direita, o caminho do fogo.",
                        "score": 10,
                        "damage": 0,
                        "consequence": "Você segue o caminho, conforme o clima esquenta e você vê vapores vulcânicos emergindo de frestas."
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    }
                ]
            }
        ]
    }

]