[
    {
        "act":3,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Tentar ler as inscrições mágicas.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "Você facilmente decifra as runas, a porta se abre."
                    },
                    {
                        "id": 2,
                        "text": "Tentar arrombar o mecanismo de tranca.",
                        "score": -5,
                        "damage": 0,
                        "consequence": "Você passa horas tentando destravar o mecanismo, até que finalmente desiste e lê as runa mágicas para abrir a porta."
                    },
                    {
                        "id": 3,
                        "text": "Usar a Magia: Bola de Fogo para derrubar a porta.",
                        "score": -5,
                        "damage": 5,
                        "consequence": "Você derruba a porta com uma bola de fogo, causando um desabamento que o fere."
                    },
                    {
                        "id": 4,
                        "text": "Meditar para tentar encontrar uma maneira de entrar.",
                        "score": 0,
                        "damage": 0,
                        "consequence": "Você medita para tentar encontrar uma solução, mas nada vem em mente e você decide ler as runas magicas para abrir a porta."
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Engajar o combate usando a Magia: Bola de Fogo.",
                        "score": 5,
                        "damage": 0,
                        "consequence": "Você dispara uma bola de fogo que dizima os esqueletos, as paredes encantadas absorvem todo o impacto."
                    },
                    {
                        "id": 2,
                        "text": "Engajar o combate usando a Magia: Mísseis Mágicos",
                        "score": 0,
                        "damage": 10,
                        "consequence": "Ao atingir o primeiro, os demais despertam e vem o atacar, fazendo com que você seja ferido algumas vezes."
                    },
                    {
                        "id": 3,
                        "text": "Correr para passar rapidamente pelos inimigos.",
                        "score": -5,
                        "damage": 20,
                        "consequence": "O piso de gelo é liso, você perde o equilíbrio e acaba caindo, enquanto os inimigos lhe atacam impiedosamente até que você possa se levantar e contra-atacar."
                    },
                    {
                        "id": 4,
                        "text": "Passar furtivamente sem tentar chamar atenção.",
                        "score": -5,
                        "damage": 20,
                        "consequence": "Furtividade não é seu forte, os inimigos percebem sua passagem e o atacam primeiro."
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Analisar o padrão das lajotas e pessoas congeladas para encontar um caminho seguro.",
                        "score": 5,
                        "consequence": "Após muito analisar, você encontra um padrão específico entre pessoas congeladas e os possíveis caminhos, traçando uma rota segura até a porta.",
                        "damage": 0
                    },
                    {
                        "id": 2,
                        "text": "Tentar saltar sobre as estátuas para chegar ao outro lado.",
                        "score": -10,
                        "consequence": "Você não é leve, nem muito habilidoso, e precisa correr. Você é atingido por raios de gelo que causam uma dor intensa.",
                        "damage": 20
                    },
                    {
                        "id": 3,
                        "text": "Fechar os olhos e deixar com que as forças maiores o guiem.",
                        "score": -10,
                        "consequence": "Você fecha os olhos e segue, não demora muito para sentir um ataque de gelo e precisar correr. Você é atingido por raios de gelo que causam uma dor intensa.",
                        "damage": 30
                    },
                    {
                        "id": 4,
                        "text": "Usar sua Magia: Telecinese para empilhar os corpos congelados fazendo uma ponte.",
                        "score": 0,
                        "consequence": "Você cria uma ponte sinistra de cadáveres e passa pelo local com alguma dificuldade.",
                        "damage": 0
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Tomar a Coroa.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "Você ignora o aviso e toma a coroa para si, a porta do templo é selada e so há como sair escalando para a abertura que há metros acima."
                    },
                    {
                        "id": 2,
                        "text": "Aceitar o Anel de Gelo.",
                        "score": 15,
                        "damage": -70,
                        "consequence": "Você aceita o anel, a voz feminina agradece e do centro da coroa um anel azul e belo, com uma gema fria em seu topo. O anel vem até seu dedo e você sente uma enrgia poderosa. Seu sangue fica frio, suas feridas são curadas, seus equipamentos e energias são envoltos de uma energiaa fria. Você é levitado até o topo do local onde há uma saída da caverna."
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "damage": 0,
                        "consequence": ""
                    }
                ]
            }
        ]
    },
    {
        "act":3,
        "events":[
            {
                "id": 1,
                "options":[
                    {
                        "id": 1,
                        "text": "Usar sua Magia: Telecinese para derrubar estalactites e estalagmites para fazer um caminho sobre a lava.",
                        "score": 0,
                        "consequence": "Você derruba facilmente muitas rochas fazendo um caminho no qual se pode caminhar com segurança e atravessa, sofrendo graves queimaduras.",
                        "damage": 10
                    },
                    {
                        "id": 2,
                        "text": "Saltar sobre as estalagmites, se apoiando nas estalagmites quando possível.",
                        "score": -5,
                        "consequence": "Sua habilidade não auxiliam, você acaba caindo e se queimando em lava.",
                        "damage": 20
                    },
                    {
                        "id": 3,
                        "text": "Usar sua Magia: Bola de Fogo na lava.",
                        "score": -5,
                        "consequence": "Você usa a bola de fogo, quebrando algumas rochas e fazendo um caminho pouco seguro, você acaba caindo de uma rocha solta na passagem.",
                        "damage": 20
                    },
                    {
                        "id": 4,
                        "text": "Tomar impulso e saltas sobre o rio de lava.",
                        "score": -10,
                        "consequence": "Você cai e se machuca severamente.",
                        "damage": 30
                    }
                ]
            },
            {
                "id": 2,
                "options":[
                    {
                        "id": 1,
                        "text": "Usar a sua Magia: Bola de Fogo contra ele.",
                        "score": -5,
                        "consequence": "Bola de Fogo contra um monstro de lava, não foi muito efetivo. Ele o atinge com vários golpes até você conseguir o derrotar.",
                        "damage": 20
                    },
                    {
                        "id": 2,
                        "text": "Usar a sua Magia: Mísseis Mágicos contra ele.",
                        "score": 0,
                        "consequence": "A criatura é muito resistente, ele o atinge antes de você o derrotar.",
                        "damage": 10
                    },
                    {
                        "id": 3,
                        "text": "Tentar fugir e o despistar.",
                        "score": -5,
                        "consequence": "Fugir não é seu forte, a criatura arremessa algumas rochas em chamas até que você consiga a despistar.",
                        "damage": 15
                    },
                    {
                        "id": 4,
                        "text": "Usar a Magia: Sono para derrubar a criatura.",
                        "score": 0,
                        "consequence": "A criatura cai em um sono profundo, mas ainda assim passar perto de seu corpo quente causa queimaduras.",
                        "damage": 5
                    }
                ]
            },
            {
                "id": 3,
                "options":[
                    {
                        "id": 1,
                        "text": "Estuda o mecanismo para bolar um jeito de o abrir.",
                        "score": 0,
                        "consequence": "Você estuda muito o mecanismo até perceber que girando a grande roda é o único jeito. Você o faz com muito esforço.",
                        "damage": 0
                    },
                    {
                        "id": 2,
                        "text": "Usa sua Magia: Telecinese para girar a roda.",
                        "score": 5,
                        "consequence": "Você se concentra para girar a roda com sua telecinese e em pouco tempo o faz.",
                        "damage": 0
                    },
                    {
                        "id": 3,
                        "text": "Usa sua Magia: Bola de Fogo para tentar abrir a porta.",
                        "score": -10,
                        "consequence": "A porta abre com a força da magia, mas o impacto faz rochas caírem sobre você.",
                        "damage": 5
                    },
                    {
                        "id": 4,
                        "text": "Estuda a tranca para procurar por falhas.",
                        "score": 0,
                        "consequence": "Você observa a tranca e descobre um ponto fraco, atirando um Míssil Mágico no ponto certo você faz com que a porta se abra.",
                        "damage": 0
                    }
                ]
            },
            {
                "id": 4,
                "options":[
                    {
                        "id": 1,
                        "text": "Tomar a Coroa.",
                        "score": -10,
                        "damage": 0,
                        "consequence": "Você ignora o aviso e toma a coroa para si, a porta do templo é selada e so há como sair escalando para a abertura que há metros acima."
                    },
                    {
                        "id": 2,
                        "text": "Aceitar o Anel de Fogo.",
                        "score": 15,
                        "damage": -70,
                        "consequence": "Você aceita o anel, a voz feminina agradece e do centro da coroa um anel dourado e belo, com uma gema quente em seu topo. O anel vem até seu dedo e você sente uma enrgia poderosa. Seu sangue fica ferve, suas feridas são curadas, seus equipamentos e energias são envoltos de uma aura quente. Você é levitado até o topo do local onde há uma saída da caverna."
                    },
                    {
                        "id": 3,
                        "text": "",
                        "score": 0,
                        "consequence": "",
                        "damage": 0
                    },
                    {
                        "id": 4,
                        "text": "",
                        "score": 0,
                        "consequence": "",
                        "damage": 0
                    }
                ]
            }
        ]
    }

]